#!/bin/bash

use()
{
    echo ""
    echo "===================================================="
    echo "1. ========可以使用let进行四则运算和求余求模======"
    echo "=右边，运算符和括号两边都不可以有空格"
    echo ""
    let result1=4+2
    echo "let reault=4+2#加 <- $result1"
    echo ""
    echo "2. ========可以使用expr进行四则运算和求余求模======"
    echo "*和（和）必须使用转移字符(\)进行转移"
    echo "expr和运算符/括号两边必须有空格，否则返回的将是字符串"
    echo ""
    result2=`expr 4 + 2`
#这里如果在\`和#那里没有空格的话颜色就会显示乱了。
    echo "\`expr 4 + 2 \` #加 <- $result2"
    echo "3. ========可以使用((...))进行四则运算和求余求模======"
    result3=$(( 4 + 2 ))
    echo "result=\$((4+2)) #加 <- $result3"
    echo "===================================================="
}
use
read a


